# Найменша відстань між локальними максимумами

# Визначте найменшу відстань між двома локальними максімумами послідовності натуральних чисел, яка завершується числом 0. Локальним максимумом називається таке число в послідовності, яка більше своїх сусідів. Якщо в последовательності немає двох локальних максимумів, виведіть число 0. Початкове і кінцеве значення при цьому локальними максимумами не рахуються.
#
# ## Формат введення
#
# Вводиться послідовність цілих чисел, що закінчується числом 0 (саме число 0 в послідовність не входить, а є ознакою її закінчення).
#
# ## Формат виведення
#
# Виведіть відповідь до задачі.
#
# ## Примітки
#
# Пояснення до тестів:
#
# У першому тесті локальними максимумами є всі двійки (вони більше сусідів). Між останніми - відстань найменша.
#
# У другому тесті немає локального максимуму.
#
# ## Приклади
#
# ```bash
# Тест 1
# Вхідні дані:
# 1
# 2
# 1
# 1
# 2
# 1
# 2
# 1
# 0
# Виведення програми:
# 2
#
# Тест 2
# Вхідні дані:
# 1
# 2
# 3
# 0
# Виведення програми:
# 0
# ```
#
# ## Розв'язання


