# Максимальна довжина монотонного фрагмента
#
# Дана послідовність натуральних чисел, що завершується числом 0. Визначте найбільшу довжину монотонного фрагмента послідовності (тобто такого фрагмента, де всі елементи або більше попереднього, або менші).
#
# ## Формат введення
#
# Вводиться послідовність цілих чисел, що закінчується числом 0 (саме число 0 в послідовність не входить, а служить як ознака її закінчення).
#
# ## Формат виведення
#
# Виведіть відповідь до задачі.
#
# ## Приклади
#
# ```bash
# Тест 1
# Вхідні дані:
# 1
# 7
# 7
# 9
# 1
# 0
# Виведення програми:
# 2
#
# Тест 2
# Вхідні дані:
# 1
# 2
# 3
# 4
# 5
# 6
# 7
# 8
# 9
# 10
# 11
# 0
# Виведення програми:
# 11
#
# Тест 3
# Вхідні дані:
# 4
# 4
# 4
# 4
# 4
# 4
# 4
# 4
# 4
# 4
# 4
# 4
# 4
# 4
# 4
# 0
# Виведення програми:
# 1
# ```
#
# ## Розв'язання
x1 = int(input())
x2 = int(input())
n_max = 1
n = 1
while 0 == 0:
    if x2 == 0 or x1 == 0:
        break
    while x1 > x2:
        if x2 == 0:
            break
        n += 1
        if n > n_max:
            n_max = n
            x1 = x2
            x2 = int(input())
        else:
            x1 = x2
            x2 = int(input())
    n = 1
    while x1 < x2:
        n += 1
        if n > n_max:
            n_max = n
            x1 = x2
            x2 = int(input())
        else:
            x1 = x2
            x2 = int(input())
    n = 1
    while x1 == x2:
        n = 1
        x1 = x2
        x2 = int(input())
print(n_max)
