# Максимальне число поспіль рівних
#
# Дана послідовність натуральних чисел, що завершується числом 0. Визначте, яке найбільше число поспіль елементів цієї послідовності дорівнюють один одному.
#
# ## Формат введення
#
# Вводиться послідовність цілих чисел, що закінчується числом 0 (саме число 0 в послідовність не входить, і є ознакою її закінчення).
#
# ## Формат виведення
#
# Виведіть відповідь до задачі.
#
# ## Приклади
#
# ```bash
# Тест 1
# Вхідні дані:
# 1
# 7
# 7
# 9
# 1
# 0
# Виведення програми:
# 2
#
# Тест 2
# Вхідні дані:
# 1
# 2
# 3
# 4
# 5
# 6
# 7
# 8
# 9
# 10
# 11
# 0
# Виведення програми:
# 1
#
# Тест 3
# Вхідні дані:
# 4
# 4
# 4
# 4
# 4
# 4
# 4
# 4
# 4
# 4
# 4
# 4
# 4
# 4
# 4
# 0
# Виведення програми:
# 15
# ```
#
# ## Розв'язання

n = 1
nx = 0
pos = -1
prev = -1
while pos != 0:
    pos = int(input())
    if prev != -1:
        if pos == prev:
            n += 1
        else:
            if nx < n:
                nx = n
            n = 1
    prev = pos
print(nx)
