# Шаховий король ходить по горизонталі, вертикалі та діагоналі, але тільки на 1 клітинку. Дано дві різні клітинки шахової дошки, визначте, чи може король потрапити з першої клітинки на другу за один хід.

## Формат введення

# Програма отримує на вхід чотири числа від 1 до 8 кожне, що задають номер стовпця і номер рядка спочатку для першої клітинки, потім для другої клітинки.

## Формат виведення

# Програма повинна вивести YES, якщо з першої клітини ходом короля можна потрапити в другу або NO в іншому випадку.


x1 = int(input())
y1 = int(input())
x2 = int(input())
y2 = int(input())
if abs(x2 - x1) == 1 and abs(y2 - y1) == 1:
    print("YES")
elif x2 - x1 == 0 and abs(y2 - y1) == 1:
    print("YES")
elif y2 - y1 == 0 and abs(x2 - x1) == 1:
    print("YES")
else:
    print("NO")
