#На сковорідку одночасно можна покласти $$k$$ котлет. Кожну котлету потрібно з кожного боку обсмажувати $$m$$ хвилин безперервно. За який найменший час вдасться підсмажити з обох сторін $$n$$ котлет?

## Формат введення

#Програма отримує на вхід три числа: $$k$$, $$m$$, $$n$$.

## Формат виведення

#Програма повинна вивести одне число: найменшу кількість хвилин.

k = int(input())
m = int(input())
n = int(input())
if n < k + 1:
    print(2 * m)
else:
    if (2 * n) % k == 0:
        print(m * ((2 * n) // k))
    else:
        print(m * (1 + (2 * n) // k))
