# В одну транспортну компанію надійшло замовлення на перевезення двох ящиків з одного міста в інший. Для перевезення ящики вирішено було упакувати в спеціальний контейнер.
#
# Ящики і контейнер мають вигляд прямокутних паралелепіпедів. Довжина, ширина і висота першого ящика - l₁, w₁ і h₁, відповідно розміри другого ящика - l₂, w₂ і h₂. Контейнер має довжину, ширину і висоту lc, wc і hc.
#
# Оскільки ящики містять крихке обладнання, після упаковки в контейнер кожен з них повинен залишитися в строго вертикальному положенні. Таким чином, ящики можна розмістити поруч або один на іншому. Для надійного закріплення в контейнері боку ящиків повинні бути паралельні його сторонам. Інакше кажучи, якщо початково ящики були розташовані так, що всі їх сторони паралельні відповідним сторонам контейнера, то кожен з них дозволяється переміщати і повертати щодо вертикальної осі на кут, кратний 90 градусам.
#
# Зрозуміло, після упаковки обидва ящика повинні повністю перебувати всередині контейнера і не повинні перетинатися.
#
# З'ясуйте, чи можна помістити ящики в контейнер з дотриманням зазначених умов.
#
# ## Формат введення
#
# У вхідних даних записані числа l₁, w₁, h₁, l₂, w₂, h₂, lc, wc і hc. Всі розміри - цілі позитивні числа, що не перевищують 1000. Числа в рядках розділені пробілами.

l1 = int(input())
w1 = int(input())
h1 = int(input())
l2 = int(input())
w2 = int(input())
h2 = int(input())
lc = int(input())
wc = int(input())
hc = int(input())
if l1 > 1000 or w1 > 1000 or h1 > 1000\
        or l2 > 1000 or w2 > 1000 or h2 > 1000\
        or lc > 1000 or wc > 1000 or hc > 1000\
        or l1 <= 0 or w1 <= 0 or h1 <= 0\
        or l2 <= 0 or w2 <= 0 or h2 <= 0\
        or lc <= 0 or wc <= 0 or hc <= 0:
    print("NO")
elif (lc >= l1 + l2)\
        and (wc >= w1 and wc >= w2)\
        and (hc >= h1 and hc >= h2):
    print('YES')
elif (lc >= w1 + w2)\
        and (wc >= l1 and wc >= l2)\
        and (hc >= h1 and hc >= h2):
    print('YES')
elif (lc >= l1 + w2)\
        and (wc >= w1 and wc >= l2)\
        and (hc >= h1 and hc >= h2):
    print('YES')
elif (lc >= w1 + l2)\
        and (wc >= l1 and wc >= w2)\
        and (hc >= h1 and hc >= h2):
    print('YES')
elif (wc >= w1 + w2)\
        and (lc >= l1 and lc >= l2)\
        and (hc >= h1 and hc >= h2):
    print('YES')
elif (wc >= l1 + l2) \
        and (lc >= w1 and lc >= w2)\
        and (hc >= h1 and hc >= h2):
    print('YES')
elif (wc >= l1 + w2)\
        and (lc >= w1 and lc >= l2)\
        and (hc >= h1 and hc >= h2):
    print('YES')
elif (wc >= w1 + l2)\
        and (lc >= l1 and lc >= w2)\
        and (hc >= h1 and hc >= h2):
    print('YES')
elif (hc >= h1 + h2)\
        and (lc >= l1 and lc >= l2)\
        and (wc >= w1 and wc >= w2):
    print('YES')
elif (hc >= h1 + h2)\
        and (lc >= w1 and lc >= w2)\
        and (wc >= l1 and wc >= l2):
    print('YES')
elif (hc >= h1 + h2)\
        and (lc >= l2 and lc >= w1)\
        and (wc >= w2 and wc >= l1):
    print('YES')
elif (hc >= h1 + h2)\
        and (lc >= l1 and lc >= w2)\
        and (wc >= l2 and wc >= w1):
    print('YES')
else:
    print("NO")
