# Послідовність складається з натуральних чисел і завершується числом 0. Визначте, скільки елементів цієї послідовності більших попереднього елемента.
#
# ## Формат введення
#
# Вводиться послідовність цілих чисел, що закінчується числом 0 (саме число 0 в послідовність не входить, а служить як ознака її закінчення).
#
# ## Формат виведення
#
# Виведіть відповідь до задачі.
#
# ## Приклади
#
# ```bash
# Тест 1
# Вхідні дані:
# 1
# 7
# 9
# 0
# Виведення програми:
# 2
#
# Тест 2
# Вхідні дані:
# 1
# 5
# 2
# 4
# 3
# 0
# Виведення програми:
# 2
#
# Тест 3
# Вхідні дані:
# 1
# 2
# 3
# 4
# 5
# 0
# Виведення програми:
# 4
# ```
#
# ## Розв'язання

n = -1
m = -1
z = -1
while n != 0:
    n = int(input())
    if n > m:
        z += 1
    m = n
print(z)
