# Послідовність Фібоначчі визначається так:
#
# $$F[0] = 0, F[1] = 1, ..., F[n] = F[n-1] + F[n-2]$$.
#
# Дано натуральне число A. Визначте, яким за рахунком є числом Фібоначчі, тобто виведіть таке число n, що
#
# $$F[n] = A$$
#
# Якщо А не є числом Фібоначчі, виведіть число -1.
#
# ## Формат введення
#
# Вводиться натуральне число A.
#
# ## Формат виведення
#
# Виведіть відповідь до задачі.
#
# ## Приклади
#
# ```bash
# Тест 1
# Вхідні дані:
# 8
# Виведення програми:
# 6
#
# Тест 2
# Вхідні дані:
# 10
# Виведення програми:
# -1
#
# Тест 3
# Вхідні дані:
# 13
# Виведення програми:
# 7
# ```
#
# ## Розв'язання

n = int(input())
if n == 0:
    print(0)
else:
    n1, n2 = 0, 1
    i = 1
    while n2 <= n:
        if n2 == n:
            print(i)
            break
        n1, n2 = n2, n1 + n2
        i += 1
    else:
        print(-1)
