# Переставте цифри числа у зворотному порядку.
# 
# ## Формат введення
# 
# Задано єдине число N
# 
# ## Формат виведення
# 
# Необхідно вивести цифри даного числа у зворотному порядку.
# 
# ## Приклади
# 
# ```bash
# Тест 1
# Вхідні дані:
# 1
# Виведення програми:
# 1
# 
# Тест 2
# Вхідні дані:
# 12
# Виведення програми:
# 21
# 
# Тест 3
# Вхідні дані:
# 874
# Виведення програми:
# 478
# ```
# 
# ## Розв'язання

a = int(input())
n = 0
while a > 0:
    z = a % 10
    a //= 10
    n *= 10
    n += z
print(n)
