## Для даного числа n <100 закінчите фразу "На лузі пасеться ..." одним з можливих продовжень: "n корів", "n корова", "n корови", правильно схиляючи слово "корова".
##
## Формат введення
##
## Вводиться натуральне число.
##
## Формат виведення
##
## Програма повинна вивести введене число n і одне зі слів: korov, korova або korovy. Між числом і словом повинен стояти рівно один пробіл.


n = int(input())
if 9 < n < 21:
    print(n, "korov")
elif n % 10 == 2 or n % 10 == 3 or n % 10 == 4:
    print(n, "korovy")
elif n % 10 == 1:
    print(n, "korova")
else:
    print(n, "korov")
