## В математиці функція `sign (x)` (знак числа) визначена так:
##
## `sign (x) = 1`, якщо `x > 0`,
##
## `sign (x) = - 1`, якщо `x < 0`,
##
## `sign (x) = 0`, якщо `x = 0`.
##
## Для даного числа x виведіть значення `sign (x)`.
##
## Формат введення
##
## Вводиться одне ціле число.
##
## Формат виведення
##
## Виведіть відповідь до задачі.
##
## Примітки
##
## Цю задачу бажано вирішити з використанням каскадних інструкцій `if ... elif ... else `

x = int(input())
if x > 0:
    print(1)
elif x < 0:
    print(-1)
else:
    print(0)
