# Напишіть програму, яка вітає користувача, виводячи слово Hello, введене ім'я і розділові знаки за зразком (див. Приклад вхідних і вихідних даних). Програма повинна зчитувати в строкову змінну значення і писати відповідну вітання. Зверніть увагу, що після коми повинен обов'язково стояти пробіл, а перед знаком оклику пробілу немає. Операцією конкатенації рядків (+) користуватися не можна.
# Формат ввода
# Вводится строка, длина которой не превышает 100 символов.
# Формат вывода
# Выведите ответ на задачу.

name = input()
print("Hello, ", name, "!", sep="")
