# Дано число N. З початку доби минуло N хвилин. Визначте, скільки годин і хвилин показуватиме електронний годинник в цей момент.

## Формат введення

# Вводиться число N - ціле, позитивне, не перевищує 10⁷.

## Формат виведення

# Програма повинна вивести два числа: кількість годин (від 0 до 23) і кількість хвилин (від 0 до 59).

# Врахуйте, що число N може бути більше, ніж кількість хвилин в добі.


n = int(input())
print(((n // 60) % 24), n % 60)
