# Дано двозначне число. Знайдіть число десятків у ньому.

## Формат введення

# Вводиться однина (гарантується, що воно відповідає умові завдання).

## Формат виведення

# Виведіть відповідь до задачі.

n = int(input())
print(n // 10)
