## Послідовність складається з натуральних чисел, що не перевершують 10⁹, і завершується числом 0.Визначте значення найбільшого елементу послідовності.
##
## Формат введення
##
## Вводиться послідовність цілих чисел, що закінчується числом 0 (саме число 0 в послідовність не входить, а служить як ознака її закінчення).
##
## Формат виведення
##
## Виведіть відповідь до задачі.
now = int(input())
maxNum = now
while now != 0:
    now = int(input())
    if now != 0 and now > maxNum:
        maxNum = now
print(maxNum)
