# Обчисліть суму всіх елементів послідовності, яка завершується числом 0.
#
# ## Формат введення
#
# Вводиться послідовність цілих чисел, що закінчується числом 0 (саме число 0 в послідовність не входить, а служить як ознака її закінчення.
#
# ## Формат виведення
#
# Виведіть відповідь до задачі.
#
# ## Приклади
#
# ```bash
# Тест 1
# Вхідні дані:
# 1
# 7
# 9
# 0
#
# Виведення програми:
# 17
#
#
# Тест 2
# Виведення програми:
# 1
# 1
# 1
# 1
# 1
# 1
# 1
# 1
# 1
# 0
#
# Вывод программы:
# 9
#
#
# Тест 3
# Вхідні дані:
# 34
# 2345
# 2345
# 2345
# 2345
# 345
# 3
# 345
# 3
# 345
# 1
# 3
# 424
# 5
# 453
# 0
#
# Виведення програми:
# 11341
# ```

n = int(input())
suma = 0
while n != 0:
    suma += n
    n = int(input())
print(suma)
