# Послідовність складається з натуральних чисел і завершується числом 0. Визначте, яка кількість елементів цієї послідовності, рівних її найбільшому елементу.
# 
# ## Формат введення
# 
# Вводиться послідовність цілих чисел, що закінчується числом 0 (саме число 0 в послідовність не входить, а служить ознакою її закінчення).
# 
# ## Формат виведення
# 
# Виведіть відповідь до задачі.
# 
# ## Приклади
# 
# ```bash
# Тест 1
# Вхідні дані:
# 1
# 7
# 9
# 0
# Виведення програми:
# 1
# 
# Тест 2
# Вхідні дані:
# 1
# 3
# 3
# 1
# 0
# Виведення програми:
# 2
# 
# Тест 3
# Вхідні дані:
# 1
# 2
# 3
# 4
# 5
# 0
# Виведення програми:
# 1
# ```


a = int(input())
max = a
n = 0
while a != 0:
    if a > max:
        max = a
        n = 1
    elif a == max:
        n += 1
    a = int(input())
print(n)
