# Визначте кількість парних елементів в послідовності, яка завершується числом 0.
#
# ## Формат введення
#
# Вводиться послідовність цілих чисел, що закінчується числом 0 (саме число 0 в послідовність не входить, а служить як ознака її закінчення).
#
# ## Формат виведення
#
# Виведіть відповідь до задачі.
#
# ## Приклади
#
# ```bash
# Тест 1
# Вхідні дані:
# 2
# 1
# 4
# 0
# Виведення програми:
# 2
#
# Тест 2
# Вхідні дані:
# 1
# 3
# 5
# 7
# 9
# 1
# 3
# 5
# 7
# 9
# 0
# Виведення програми:
# 0
#
# Тест 3
# Вхідні дані:
# 2
# 4
# 0
# Виведення програми:
# 2
# ```
#
# ## Розв'язання

n = -1
z = -1
while n != 0:
    n = int(input())
    if n % 2 == 0:
        z += 1
    else:
        z += 0
print(z)
