# Електронний годинник показує час в форматі h:mm:ss, тобто спочатку записується кількість годин (число від 0 до, потім обов'язково двозначну кількість хвилин, потім обов'язково двозначну кількість секунд. Кількість хвилин і секунд при необхідності доповнюються до двозначного числа нулями.

# З початку доби минуло N секунд. Виведіть, що покажe годинник.

## Формат введення

# Вводиться число N - ціле, позитивне, не перевищує 10⁷.

## Формат виведення

#  показання годин, дотримуючись формату.

## Примітки

# Вивести числа можна поциферно.

n = int(input())
h = n // 3600
h = h % 24
n = n % 3600
min_m = n % 3600
hv = min_m // 60
min_d = hv // 10
min_e = hv % 10
sec = n % 60
sec_d = sec // 10
sec_e = sec % 10
print(h, ":", min_d, min_e, ":", sec_d, sec_e, sep="")
