# Дано два моменти часу в межах однієї і тієї же доби. Для кожного моменту вказано година, хвилина і секунда. Відомо, що другий момент часу настав не раніше першого.

# Визначте скільки секунд пройшло між двома моментами часу.

## Формат введення

# Програма на вхід отримує шість цілих чисел через новий рядок. Перші три цілих числа відповідають годинах, хвилинах і секундах першого моменту, наступні три числа відповідають другому моменту.

# Годинники задаються числом від 0 до 23 включно. Хвилини і секунди - від 0 до 59.

## Формат виведення

# Виведіть число секунд між цими моментами часу.

h1 = int(input())
m1 = int(input())
s1 = int(input())
h2 = int(input())
m2 = int(input())
s2 = int(input())
riz_h = h2 - h1
riz_m = m2 - m1
riz_s = s2 - s1
print(riz_h * 3600 + riz_m * 60 + riz_s)
