# Дано чотиризначний число. Визначте, чи є його десятковий запис є симетричним. Якщо число симетричне, то виведіть 1, інакше виведіть будь-яке інше ціле число. Число може мати менше чотирьох знаків, тоді потрібно вважати, що його десяткова запис доповнюється зліва незначущими нулями.

## Формат введення

# Вводиться однина.

## Формат виведення

# Виведіть відповідь до задачі.


n = int(input())
n1 = n//1000
n2 = (n - n1 * 1000) // 100
n3 = (n - n1 * 1000 - n2 * 100) // 10
n4 = n - n1 * 1000 - n2 * 100 - n3 * 10
n12 = int(str(n1) + str(n2))
n43 = int(str(n4) + str(n3))
print((n43 - n12) + 1)
